# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [1]:
# your code here

%load_ext sql
%config SqlMagic.autocommit = False

In [2]:
import os
#os.getcwd()     We can access to the DB file only with absolute path (/// for relative, //// for absolute)
%sql sqlite:///../data/juliarochflores.db
#%sql sqlite:////home/agustin/ironhack/dataptmad0420/module-1/importing-exporting-data/data/juliarochflores.db

In [3]:
%%sql tables <<

SELECT 
    name
FROM 
    sqlite_master 
WHERE 
    type ='table' AND 
    name NOT LIKE 'sqlite_%';

 * sqlite:///../data/juliarochflores.db
Done.
Returning data to local variable tables

In [4]:
tables

[('rank_info',), ('personal_info',), ('business_info',)]

In [5]:
%%sql myquery <<

SELECT
business_info.id as ID_,
business_info."Source" as SOURCE_,
business_info.worth as WORTH_,
rank_info."position" as POSITION_,
rank_info.name as NAME_
from business_info
JOIN rank_info 
ON business_info.id = rank_info.id 
LIMIT 15;

 * sqlite:///../data/juliarochflores.db
Done.
Returning data to local variable myquery

In [6]:
myquery

[(8760, 'Technology  ==> Amazon', '112.0 BUSD', 1.0, 'jefF BEZOs'),
 (7500, 'Technology  ==> Microsoft', '90.0 BUSD', 2.0, 'bILL GATES'),
 (5751, 'Finance and Investments  ==> Berkshire Hathaway', '84.0 BUSD', 3.0, 'WARREN BUFFEtt'),
 (8365, 'Fashion & Retail  ==> LVMH', '72.0 BUSD', 4.0, 'bernARD ARNAULT'),
 (5328, 'Technology  ==> Facebook', '71.0 BUSD', 5.0, 'maRK ZUCKERBERG'),
 (4945, 'Fashion & Retail  ==> Zara', '70.0 BUSD', 6.0, 'amaNCIO ORTega'),
 (3712, 'Telecom  ==> telecom', '67.1 BUSD', 7.0, 'carlOS SLIM HElu'),
 (5137, 'Diversified  ==> Koch Industries', '60.0 BUSD', 8.0, 'chARLES Koch'),
 (1485, 'Diversified  ==> Koch Industries', '60.0 BUSD', 9.0, 'david KOCH'),
 (1108, 'Technology  ==> software', '58.5 BUSD', 10.0, 'larry ELLISON'),
 (3103, 'Media & Entertainment  ==> Bloomberg LP', '50.0 BUSD', 11.0, 'mICHAEL BLOOMBErg'),
 (5041, 'Technology  ==> Google', '48.8 BUSD', 12.0, 'LARRY PAGE'),
 (1353, 'Technology  ==> Google', '47.5 BUSD', 13.0, 'serGEY Brin'),
 (7144, 'Fashion & Retail  ==> Walmart', '46.4 BUSD', 14.0, 'jIM WALton'),
 (6301, 'Fashion & Retail  ==> Walmart', '46.2 BUSD', 15.0, 's. robsON WAlton')]

# Challenge 2 - Working with JSON files

Import the pandas library.

In [8]:
# your code here
import pandas as pd
import os

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [9]:
# your code here
os.getcwd()                               # I check in advance the right path to put in the code
os.path.exists('../data')
nasa=pd.read_json('../data/nasa.json')

Now that we have loaded the data, let's examine it using the `head()` function.

In [10]:
# your code here
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [12]:
# your code here
nasa['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [13]:
# your code here
nasa.to_json('../data/nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [14]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [15]:
# your code here
shuttle=pd.read_csv(tst_url,sep=' ',names=cols)

Let's verify that this worked by looking at the `head()` function.

In [16]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [17]:
# your code here
shuttle.to_csv('../data/shuttle.csv',sep=',',index=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [18]:
# your code here
astronaut=pd.read_excel('../data/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [20]:
# your code here
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [21]:
# your code here
astronaut['Undergraduate Major'].value_counts()

Physics                                                                35
Aerospace Engineering                                                  33
Mechanical Engineering                                                 30
Aeronautical Engineering                                               28
Electrical Engineering                                                 23
                                                                       ..
Physiology                                                              1
Aeronautics & Astronautics; Earth, Atmospheric & Planetary Sciences     1
Animal Nutrition                                                        1
Business Economics                                                      1
Physical Science                                                        1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [22]:
# your code here
astronaut.to_csv('../data/astronaut.csv',sep='\t', index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [23]:
# your code here

from zipfile import ZipFile

z = ZipFile('../data/challenge3.zip', 'r')

z.infolist()                                   # We can check the names of the files

[<ZipInfo filename='Food_Supply_Quantity_kg_Data_No_Header.txt' compress_type=deflate filemode='-rw-rw-r--' file_size=30371 compress_size=13676>,
 <ZipInfo filename='Supply_Food_Data_Descriptions.csv' compress_type=deflate filemode='-rw-rw-r--' file_size=3669 compress_size=1095>]

In [24]:
descrip=pd.read_csv(z.open('Supply_Food_Data_Descriptions.csv'))# This file with only 22 names of columms
list_of_22_categ=descrip['Categories'].to_list()
list_of_24_categ=list_of_22_categ + ['0', '1']         # I create a list with 22 names plus 2 more
list_of_24_categ.sort()
list_of_24_categ[0]='Index'
list_of_24_categ[1]='Country'
print(type(list_of_24_categ))
len(list_of_24_categ)
list_of_24_categ

<class 'list'>

['Index',
 'Country',
 'Alcoholic Beverages',
 'Animal Products',
 'Animal fats',
 'Aquatic Products, Other',
 'Cereals - Excluding Beer',
 'Eggs',
 'Fish, Seafood',
 'Fruits - Excluding Wine',
 'Meat',
 'Milk - Excluding Butter',
 'Miscellaneous',
 'Offals',
 'Oilcrops',
 'Pulses',
 'Spices',
 'Starchy Roots',
 'Stimulants',
 'Sugar & Sweeteners',
 'Sugar Crops',
 'Treenuts',
 'Vegetable Oils',
 'Vegetables',
 'Vegetal Products']

In [25]:
# The file .txt has somes data error in at least row 82.
# We can avoid this row with 'error_bad_lines=False'

food=pd.read_csv(z.open('Food_Supply_Quantity_kg_Data_No_Header.txt'),sep='\t', error_bad_lines=False, header=None)
food.columns = \
['Index',
 'Country',
 'Alcoholic Beverages',
 'Animal Products',
 'Animal fats',
 'Aquatic Products, Other',
 'Cereals - Excluding Beer',
 'Eggs',
 'Fish, Seafood',
 'Fruits - Excluding Wine',
 'Meat',
 'Milk - Excluding Butter',
 'Miscellaneous',
 'Offals',
 'Oilcrops',
 'Pulses',
 'Spices',
 'Starchy Roots',
 'Stimulants',
 'Sugar & Sweeteners',
 'Sugar Crops',
 'Treenuts',
 'Vegetable Oils',
 'Vegetables',
 'Vegetal Products']
food

,Index,Country,Alcoholic Beverages,Animal Products,Animal fats,"Aquatic Products, Other",Cereals - Excluding Beer,Eggs,"Fish, Seafood",Fruits - Excluding Wine,...,Pulses,Spices,Starchy Roots,Stimulants,Sugar & Sweeteners,Sugar Crops,Treenuts,Vegetable Oils,Vegetables,Vegetal Products
0,0,Afghanistan,0.0014,0.1973,9.4341,0.0000,24.8097,0.2099,0.0350,5.3495,...,0.2953,0.0574,0.8802,0.3078,1.3489,0.000,0.0770,0.5345,6.7642,40.5645
1,1,Albania,1.6719,0.1357,18.7684,0.0000,5.7817,0.5815,0.2126,6.7861,...,0.2380,0.0008,1.8096,0.1055,1.5367,0.000,0.1515,0.3261,11.7753,31.2304
2,2,Algeria,0.2711,0.0282,9.6334,0.0000,13.6816,0.5277,0.2416,6.3801,...,0.4783,0.0557,4.1340,0.2216,1.8342,0.000,0.1152,1.0310,11.6484,40.3651
3,3,Angola,5.8087,0.0560,4.9278,0.0000,9.1085,0.0587,1.7707,6.0005,...,0.6507,0.0009,18.1102,0.0508,1.8495,0.000,0.0061,0.6463,2.3041,45.0722
4,4,Antigua and Barbuda,3.5764,0.0087,16.6613,0.0000,5.9960,0.2274,4.1489,10.7451,...,0.1840,0.1524,1.4522,0.1564,3.8749,0.000,0.0253,0.8102,5.4495,33.3233
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
165,165,Venezuela (Bolivarian Republic of),2.5952,0.0403,14.7565,0.0000,12.9253,0.3389,0.9456,7.6460,...,0.3342,0.0009,2.5643,0.1479,3.4106,0.000,0.0009,1.3734,4.1474,35.2416
166,166,Vietnam,1.4591,0.1640,8.5765,0.0042,16.8740,0.3077,2.6392,5.9029,...,0.2032,0.2074,1.0596,0.2880,1.2846,0.815,0.3070,0.2201,11.9508,41.4232
167,167,Yemen,0.0364,0.0446,5.7874,0.0000,27.2077,0.2579,0.5240,5.1344,...,0.8645,0.0347,1.0794,0.2199,5.0468,0.000,0.0017,1.0811,3.2135,44.2126
168,168,Zambia,5.7360,0.0829,6.0197,0.0000,21.1938,0.3399,1.6924,1.0183,...,0.1756,0.0478,7.9649,0.0618,1.5632,0.000,0.0014,0.6657,3.4649,43.9789
169,169,Zimbabwe,4.0552,0.0755,8.1489,0.0000,22.6240,0.2678,0.5518,2.2000,...,0.4261,0.0252,2.9870,0.1494,4.6485,0.000,0.0518,1.7103,2.3213,41.8526